# Brewfile

tap "homebrew/bundle"        # Adds brew bundle support (Brewfile workflow)
tap "homebrew/cask"          # GUI apps and large binary packages
tap "homebrew/cask-fonts"    # Fonts as casks (Nerd Fonts, etc.)

# CLI tools (formulae)

brew "findutils"             # GNU find, xargs, locate, updatedb (g-prefixed tools)
brew "bat"                   # Better cat with syntax highlighting
brew "ffmpeg"                # Audio/video conversion and processing Swiss army knife
brew "fx"                    # Interactive JSON viewer for the terminal
brew "gh"                    # Official GitHub CLI
brew "iftop"                 # Real-time network bandwidth monitor per connection
brew "imagemagick"           # Image conversion and manipulation toolkit
brew "jq"                    # JSON processor (slice, filter, transform)
brew "libjpeg"               # JPEG codec library (dependency for image tools)
brew "libmemcached"          # libmemcached client library (Memcached support)
brew "markdown"              # CLI Markdown processor/converter
brew "mas"                   # Mac App Store CLI (install apps by ID)
brew "mc"                    # Midnight Commander terminal file manager
brew "node"                  # Node.js runtime (JS tooling, scripts)
brew "speedtest-cli"         # Internet speed test from the terminal
brew "tree"                  # Directory tree printer
brew "vim"                   # Vim editor
brew "wget"                  # File downloader (HTTP/HTTPS/FTP)
brew "yt-dlp"                # YouTube and media downloader (modern replacement for youtube-dl)
brew "lazygit"               # Terminal UI for git (fast staging, logs, branches, conflicts)
brew "lazydocker"            # Terminal UI for Docker + docker compose (containers, logs, stats)
brew "btop"                  # Modern resource monitor (CPU/RAM/disk/network) in the terminal

# GUI apps (casks)

cask "balenaetcher"          # Flash images to SD cards and USB drives
cask "docker"                # Docker Desktop for macOS
cask "github"                # GitHub Desktop app
cask "google-chrome"         # Chrome browser
cask "iterm2"                # Better terminal app than Terminal.app
cask "visual-studio-code"    # VS Code editor
cask "jordanbaird-ice"       # Menubar manager

