# Brewfile

tap "homebrew/bundle"        # Adds brew bundle support (Brewfile workflow)
tap "homebrew/cask"          # GUI apps and large binary packages
tap "homebrew/cask-fonts"    # Fonts as casks (Nerd Fonts, etc.)

# CLI tools (formulae)

brew "bat"                      # Better cat with syntax highlighting
brew "btop"                     # Modern resource monitor (CPU/RAM/disk/network) in the terminal
brew "fastfetch"                # ASCII logo + system info on shell startup (via ~/.zshrc fastfetch block)
brew "ffmpeg"                   # Audio/video conversion and processing Swiss army knife
brew "findutils"                # GNU find, xargs, locate, updatedb (g-prefixed tools)
brew "fx"                       # Interactive JSON viewer for the terminal
brew "gh"                       # Official GitHub CLI
brew "iftop"                    # Real-time network bandwidth monitor per connection
brew "imagemagick"              # Image conversion and manipulation toolkit
brew "jq"                       # JSON processor (slice, filter, transform)
brew "lazydocker"               # Terminal UI for Docker + docker compose (containers, logs, stats)
brew "lazygit"                  # Terminal UI for git (fast staging, logs, branches, conflicts)
brew "libjpeg"                  # JPEG codec library (dependency for image tools)
brew "libmemcached"             # libmemcached client library (Memcached support)
brew "lsd"                      # Prettier ls replacement (your ~/.zshrc aliases ls to lsd when installed)
brew "magic-wormhole"           # Simple, secure file transfer between computers :contentReference[oaicite:3]{index=3}
brew "markdown"                 # CLI Markdown processor/converter
brew "mas"                      # Mac App Store CLI (install apps by ID)
brew "mc"                       # Midnight Commander terminal file manager
brew "ncdu"                     # TUI disk-usage viewer (fast way to find big folders) :contentReference[oaicite:0]{index=0}
brew "neovim" # Modern Vim fork with LSP-friendly ecosystem (aka nvim)
brew "node"                     # Node.js runtime (JS tooling, scripts)
brew "pure"                     # Pretty, minimal and fast ZSH prompt
brew "ranger"                   # Keyboard-driven file browser in the terminal :contentReference[oaicite:1]{index=1}
brew "speedtest-cli"            # Internet speed test from the terminal
brew "tree"                     # Directory tree printer
brew "vim"                      # Vim editor
brew "watch"                    # Re-run a command every N seconds and show live output :contentReference[oaicite:2]{index=2}
brew "wget"                     # File downloader (HTTP/HTTPS/FTP)
brew "yt-dlp"                   # YouTube and media downloader (modern replacement for youtube-dl)
brew "zsh-syntax-highlighting"  # Syntax highlighting as you type in zsh 

# GUI apps (casks)

cask "balenaetcher"          # Flash images to SD cards and USB drives
cask "cleanshot"             # CleanShot X screenshot + screen recording tool
cask "docker"                # Docker Desktop for macOS
cask "github"                # GitHub Desktop app
cask "google-chrome"         # Chrome browser
cask "iterm2"                # Better terminal app than Terminal.app
cask "popclip"               # Pop-up action bar when you select text
cask "visual-studio-code"    # VS Code editor
cask "jordanbaird-ice"       # Menubar manager
